package task2;
// Объявить переменные всех вам известных типов и вывести их значения на экран. //
public class Types {
    byte num = 100; // 8 бит  -128  +127
    short num1 = 131; // 16 бит  -32768  +32767
    int num2 = 141; // 32 бит  -2 147 483 648  +2 147 483 648
    long num3 = 123; // 64 бит  -9 223 372 836 854 775 888  +9 223 372 836 854 775 887

    float num4 = 1.1f; // 32 бит 1.123456....  6-7 знаков после запятой, что мало..  f для работы переменной
    double num5 = 1.11d; // 64 бит   15 знаков

    char sum = '\u2122'; // 64 бит
    boolean isTrue = false; // или true 1




    }
